#include "include/Parse.h"

//**************************************************************************************************
// Function main()
//**************************************************************************************************

// Приём *.txt файла и перевод его в бинарник//

int main(int argc, char *argv[])
{
    if(Parse::FromTxtToBin(argv[1], argv[2]))   //Первый аргумент - путь к файлу.txt, Второй - путь к файлу.bin
        std::cout << "ERROR\n";

    return 0;
}
